#include <stdio.h>

const char *const K[] = {

	['q'] = "\u0686", // چ
	['w'] = "\u06cb", // ۋ
	['e'] = "\u06d0", // ې
	['r'] = "\u0631", // ر
	['t'] = "\u062a", // ت
	['y'] = "\u064a", // ي
	['u'] = "\u06c7", // ۇ
	['i'] = "\u06ad", // ڭ
	['o'] = "\u0648", // و
	['p'] = "\u067e", // پ

	['a'] = "\u06be", // ھ
	['s'] = "\u0633", // س
	['d'] = "\u062f", // د 
	['f'] = "\u0627", // ا 
	['g'] = "\u06d5", // ە 
	['h'] = "\u0649", // ى 
	['j'] = "\u0642", // ق 
	['k'] = "\u0643", // ك 
	['l'] = "\u0644", // ل

	['z'] = "\u0632",  // ز
	['x'] = "\u0634",  // ش
	['c'] = "\u063a",  // غ
	['v'] = "\u06c8",  // ۈ
	['b'] = "\u0628",  // ب
	['n'] = "\u0646",  // ن
	['m'] = "\u0645",  // م
	['/'] = "\u0626",  // ئ ؟

	['D'] = "\u062f", // ژ
  ['F'] = "\u0627", // ف
  ['G'] = "\u06d5", // گ
  ['H'] = "\u0649", // خ
  ['J'] = "\u0642", // ج
  ['K'] = "\u0643" // ۆ



_Static_assert(27*sizeof(const char*) == sizeof(K));

void a(char x) {
	assert('a' <= x && x <= 'z' || 
}

void f(char x) {
	assert
}

int main() {
	printf("%c = %s\n", 'r', K['r']);
	return 0;
}

